src/cf/src/Catalogs/ДоговорыСКонтрагентами/ДоговорыСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыСКонтрагентами</name>
  <attributes>
    <name>БанковскийСчёт</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчётКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчётов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчётыВУсловныхЕдиницах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчётаОтсрочки</name>
    <type>
      <types>EnumRef.СпособыРасчётаОтсрочки</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКредита</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Catalogs/ДоговорыСКонтрагентами/Forms/ФормаСписка/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Заголовок") Тогда
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = Параметры.Заголовок;
	КонецЕсли;
	Если Параметры.Отбор.Свойство("Контрагент") Тогда
		Элементы.Контрагент.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура СделатьОсновным(Команда)
	СделатьОсновнымНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
	ОповеститьОбИзменении(Тип("СправочникСсылка.ДоговорыСКонтрагентами"));
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура СделатьОсновнымНаСервере(ОсновнойДоговор)
	НачатьТранзакцию();
	Попытка
		Договор = ОсновнойДоговор.ПолучитьОбъект();
		Договор.Основной = Не Договор.Основной;
		Договор.Записать();
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ДоговорыСКонтрагентами.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Справочник.ДоговорыСКонтрагентами КАК ДоговорыСКонтрагентами
		                      |ГДЕ
		                      |	ДоговорыСКонтрагентами.Контрагент = &Контрагент
		                      |	И ДоговорыСКонтрагентами.Организация = &Организация
		                      |	И ДоговорыСКонтрагентами.Ссылка <> &ОсновнойДоговор");
		Запрос.УстановитьПараметр("Контрагент", ОсновнойДоговор.Контрагент);
		Запрос.УстановитьПараметр("Организация", ОсновнойДоговор.Организация);
		Запрос.УстановитьПараметр("ОсновнойДоговор", ОсновнойДоговор);
		Выб = Запрос.Выполнить().Выбрать();
		Пока Выб.Следующий() Цикл
			Договор = Выб.Ссылка.ПолучитьОбъект();
			Договор.Основной = Ложь;
			Договор.Записать();
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Сообщить(Нстр("fr = 'Impossible de faire le principal'; ru = 'Не удалось сделать основным'; en = ""Couldn't make it basic""; es = 'No se puede hacer principal'"), СтатусСообщения.ОченьВажное);
		ВызватьИсключение;	
	КонецПопытки;
КонецПроцедуры

#КонецОбласти
